Revit 2027 API
TableCellStyle.FontVerticalAlignment Property
 The vertical alignment style of text font.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public VerticalAlignmentStyle FontVerticalAlignment { get; set; }
Public Property FontVerticalAlignment As VerticalAlignmentStyle
	Get
	Set
public:
property VerticalAlignmentStyle FontVerticalAlignment {
	VerticalAlignmentStyle get ();
	void set (VerticalAlignmentStyle value);
}
member FontVerticalAlignment : VerticalAlignmentStyle with get, set
Property Value
VerticalAlignmentStyle
 Alignment style.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
TableCellStyle Class
Autodesk.Revit.DB Namespace